{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dtype": "float32", "kernel_size": [3, 3], "batch_input_shape": [null, 32, 32, 3], "filters": 32, "bias_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "activation": "linear", "padding": "same", "bias_regularizer": null, "kernel_regularizer": null, "trainable": true, "name": "conv2d_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.1"}